app/views/access/admindone.html.erb

INSERT INTO "bookings" ("roomnum", "name", "booking_date", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  <%hour = Time.at($globaladminbooktime.to_i*3600).utc.strftime("%H")%>
  <h2>You have Booked from <%= Time.at($globaladminbooktime.to_i*3600).utc.strftime("%H")%>:00 to <%= (hour.to_i+2)%24 %>:00.
    <% Booking.create(roomnum: $globaladminroomno, name: $globaladminuser, booking_date: $globaladminbookdate, start_time: $globaladminbooktime) %>