app/controllers/access_controller.rb

  def manageadmin
    @access =  User.where(:isAdmin => "true" ).where.not(:username => $globalusername).where.not(:username => "admin").order('created_at DESC')
---
SELECT "users".* FROM "users" WHERE "users"."isAdmin" = $1 AND ("users"."username" != $2) AND ("users"."username" != $3)  ORDER BY created_at DESC  [["isAdmin", "true"], ["username", "admin"], ["username", "admin"]]

  def finaladminbook
    @adminbooked = Booking.select('start_time').where(:booking_date => $globaladminbookdate).order('start_time')
---
SELECT "bookings"."start_time" FROM "bookings" WHERE "bookings"."booking_date" = $1  ORDER BY start_time  [["booking_date", "2016-10-05"]]

  def viewallbooking
    @allbooking = Booking.all
---
SELECT "bookings".* FROM "bookings"

  def viewroomfutureschedule
    @roomfuture = Roomadd.all
---
SELECT "roomadds".* FROM "roomadds"

  def viewroombookinghistory
    @roomhistory = Roomadd.all
---
SELECT "roomadds".* FROM "roomadds"

  def admincreatebooking
    @createbooking = Roomadd.all
---
SELECT "roomadds".* FROM "roomadds"

  def searchroomfutureschedule
    $globalroom_no = params[:room_no]
    @searchresult = Booking.where(:roomnum => $globalroom_no).where("booking_date >= ?" , Time.now.to_date).where("start_time > ?" , Time.now.hour.to_s + ":00:00")
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."roomnum" = $1 AND (booking_date >= '2016-10-05') AND (start_time > '21:00:00')  [["roomnum", "103"]]

  def searchroombookinghistory
    $globalroom_no = params[:room_no]
    @searchresult = Booking.where(:roomnum => $globalroom_no).where("booking_date <= ?" , Time.now.to_date).where("start_time < ?" , Time.now.hour.to_s + ":00:00")
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."roomnum" = $1 AND (booking_date <= '2016-10-05') AND (start_time < '21:00:00')  [["roomnum", "103"]]

  def destroy
    @access=User.find(params[:id])
    @username=@access.username
    Booking.where(:name => @username).delete_all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 10]]
DELETE FROM "bookings" WHERE "bookings"."name" = $1  [["name", "user5"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 10]]

  def membercreate
    @access = User.new(user_params)
    if  @access.save
---
INSERT INTO "users" ("username", "password_digest", "email", "isAdmin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def bookadminroomdate
    @userbooking = User.all
    $globaladminroomno=Roomadd.select("room_no").where(:room_no => params[:room_no]).first.room_no
---
SELECT "users".* FROM "users"
SELECT  "roomadds"."room_no" FROM "roomadds" WHERE "roomadds"."room_no" = $1  ORDER BY "roomadds"."id" ASC LIMIT 1  [["room_no", "103"]]

  def userprofile
    @access = User.find($globaluserid)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 12]]

def viewmembers
@access =  User.where(:isAdmin => nil )
---
SELECT "users".* FROM "users" WHERE "users"."isAdmin" IS NULL

  def roomuser
    @access = User.find($globaluserid)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]

  def roomadmin
    @access = User.find($globaluserid)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 12]]

  def attempt_login
authorized_user=false
admin_user=false
    if params[:username].present? && params[:password].present?
      found_user= User.where(:username => params[:username]).first
      if found_user
        authorized_user = found_user.authenticate(params[:password])
        $globaluserid=User.select("id").where(:username => params[:username]).first.id
        $globalusername=User.select("username").where(:username => params[:username]).first.username
      if authorized_user
        if params[:isAdmin]
          admin_user = User.select("isAdmin").where(:username => params[:username]).first
---
SELECT  "users"."username" FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "admin"]]
SELECT  "users"."isAdmin" FROM "users" WHERE "users"."username" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["username", "admin"]]