app/controllers/rooms_controller.rb

  def index
  	@room=Roomadd.all
---
SELECT "roomadds".* FROM "roomadds"

	def destroy
@room =Roomadd.find(params[:id])
@room.destroy
@roomno=@room.room_no
Booking.where(:roomnum => @roomno).delete_all
---
SELECT  "roomadds".* FROM "roomadds" WHERE "roomadds"."id" = $1 LIMIT 1  [["id", 11]]
DELETE FROM "roomadds" WHERE "roomadds"."id" = $1  [["id", 11]]
DELETE FROM "bookings" WHERE "bookings"."roomnum" = $1  [["roomnum", "102"]]